import * as Yup from 'yup';

const validationFields= () => {

    return Yup.object({
        // валідація пошти
        Email: Yup.string()
            .email('Не коректно вказана пошта') //перевірки чи формат уведений правильно
            .required("Вкажіть пошту"), // перевірка чи поле не пусте

        Phone: Yup.string()
            .required('Вкажіть телефон.')  // перевірка чи поле не пусте
            .matches(/^(\s*)?(\+)?([- _():=+]?\d[- _():=+]?){10,14}(\s*)?$/, 'Телефон повинен мати формат 38 (000)-000-00-00'),//перевірки чи формат уведений правильно
            
        Fio: Yup.string()
            .required("Вкажіть логін") // перевірка чи поле не пусте
            .min(6, 'Логін має містить мінімум 6 символів.'), //перевірки чи кількість символів уведена правильно

        Password: Yup.string()
            .required('Вкажіть пароль.')  // перевірка чи поле не пусте
            .min(8, 'Пароль має містить мінімум 8 символів.') //перевірки чи кількість символів уведена правильно
            .matches(/[a-zA-Z]/, 'Пароль має містить латинські символи.'), //перевірки чи формат уведений правильно

        ConfirmPassword: Yup.string()
            .oneOf([Yup.ref('Password'), null], 'Не співпадають паролі') // перевірка чи паролі одинакові
            .required("Повтор пароля є обов'язковим"), // перевірка чи поле не пусте


        Photo: Yup.mixed()
            .required('Добавте фото'), // перевірка чи поле не пусте
        
    });
}
export default validationFields;



