import * as Yup from 'yup';

const validationFields= () => {

    return Yup.object({
        // валідація пошти
        email: Yup.string()
            .email('Не коректно вказана пошта') //перевірки чи формат уведений правильно
            .required("Вкажіть пошту"), // перевірка чи поле не пусте
        fio: Yup.string()
            .required("Вкажіть логін") // перевірка чи поле не пусте
            .min(6, 'Логін має містить мінімум 6 символів.'), //перевірки чи кількість символів уведена правильно

        password: Yup.string()
            .required('Вкажіть пароль.')  // перевірка чи поле не пусте
            .min(8, 'Пароль має містить мінімум 8 символів.') //перевірки чи кількість символів уведена правильно
            .matches(/[a-zA-Z]/, 'Пароль має містить латинські символи.'), //перевірки чи формат уведений правильно

        confirmPassword: Yup.string()
            .oneOf([Yup.ref('password'), null], 'Не співпадають паролі') // перевірка чи паролі одинакові
            .required("Повтор пароля є обов'язковим"), // перевірка чи поле не пусте

        
    });
}
export default validationFields;



